src/Catalogs/СпискиИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СпискиИнформационныхБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ДоступКСпискамИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ДоступКСпискамИнформационныхБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПризнакИзменения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ClientID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПубликацияВебСервиса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПубликацииВебСервисов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеСпискиОбщихИБ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СписокОбщихИБ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СпискиИнформационныхБаз</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/СпискиИнформационныхБаз/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
//
//
Процедура СформироватьТекстСпискаБаз(Команда)
	ТекущаяСсылка = Элементы.Список.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(ТекущаяСсылка) Тогда
		ОбщегоНазначенияСервер.ВывестиСообщение("Не выбран элемент справчника!");
		Возврат;
	КонецЕсли;	
	
	//ОткрытьФорму("ОбщаяФорма.ФормаПредпросмотраТекстовойИнформации", Новый Структура("ТекстРезультат", WebСервисWebCommonInfoBases.СформироватьТекстСпискаБаз(ТекущаяСсылка)), ЭтаФорма);
	ЗадачиНаКлиенте.ПоказатьТекстовуюИнформацию("Текст списка баз", WebСервисWebCommonInfoBases.СформироватьТекстСпискаБаз(ТекущаяСсылка));
	
	
КонецПроцедуры

&НаСервере
//
//
Процедура ОтключитьДоступностьСпискаНаСервере(ПараметрыОповещения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоступКСпискамИнформационныхБазДоступныеСпискиОбщихИБ.Ссылка
		|ИЗ
		|	Справочник.ДоступКСпискамИнформационныхБаз.ДоступныеСпискиОбщихИБ КАК ДоступКСпискамИнформационныхБазДоступныеСпискиОбщихИБ
		|ГДЕ
		|	ДоступКСпискамИнформационныхБазДоступныеСпискиОбщихИБ.СписокОбщихИБ = &СписокОбщихИБ";	
	Запрос.УстановитьПараметр("СписокОбщихИБ", ПараметрыОповещения.ТекущаяСсылка);	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТекущийОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ТекущийОбъектДоступныеСпискиОбщихИБ = ТекущийОбъект.ДоступныеСпискиОбщихИБ.Выгрузить();
		
		МассивСтрок = ТекущийОбъектДоступныеСпискиОбщихИБ.НайтиСтроки(Новый Структура("СписокОбщихИБ", ПараметрыОповещения.ТекущаяСсылка));
		Для Каждого ТекущийЭлементМассивСтрок Из МассивСтрок Цикл
			ТекущийОбъектДоступныеСпискиОбщихИБ.Удалить(ТекущийЭлементМассивСтрок);
		КонецЦикла;
		
		ТекущийОбъект.ДоступныеСпискиОбщихИБ.Загрузить(ТекущийОбъектДоступныеСпискиОбщихИБ);
		
		ТекущийОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОтключитьДоступностьСписка(Команда)
	
	ТекущаяСсылка = Элементы.Список.ТекущаяСтрока;
	Если НЕ ЗначениеЗаполнено(ТекущаяСсылка) Тогда
		ОбщегоНазначенияСервер.ВывестиСообщение("Не выбран элемент справчника!");
		Возврат;
	КонецЕсли;	
	
	ПараметрыОповещения = Новый Структура("ТекущаяСсылка", ТекущаяСсылка);
	ПоказатьВопрос(Новый ОписаниеОповещения("ОтключитьДоступностьСпискаОписаниеОповещения", ЭтаФорма, ПараметрыОповещения), "Вы уверены, что хотите удлить ссылку на текущий список из всех доступов?", РежимДиалогаВопрос.ДаНет,,, "Отключить доступность списка баз");	
	
КонецПроцедуры

&НаКлиенте
//
//
Процедура ОтключитьДоступностьСпискаОписаниеОповещения(РезультатОповещения, ПараметрыОповещения) Экспорт
	
	// Запрос на очистку содержимого списка
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		ОтключитьДоступностьСпискаНаСервере(ПараметрыОповещения);
	КонецЕсли;
	
КонецПроцедуры
